package jx3

import (
	"github.com/FloatTech/zbputils/control"
	"github.com/fumiama/cron"
)

const (
	ServiceName = "dailyNotify"
)

var date = map[int]map[string]string{
	1: {"10:00": "帮会跑商：阴山商路", "19:00": "阵营祭天：出征祭祀"},
	2: {"20:00": "阵营攻防：逐鹿中原"},
	3: {"20:00": "世界首领：少林·乱世，七秀·乱世"},
	4: {"20:00": "阵营攻防：逐鹿中原"},
	5: {"20:00": "世界首领：黑山林海，藏剑·乱世"},
	6: {"12:00": "攻防前置：南屏山", "13:00": "阵营攻防：浩气盟；奇袭：恶人谷", "19:00": "阵营攻防：浩气盟；奇袭：恶人谷"},
	7: {"12:00": "攻防前置：昆仑", "13:00": "阵营攻防：恶人谷；奇袭：浩气盟", "19:00": "阵营攻防：恶人谷；奇袭：浩气盟"},
}

//"一": "帮会跑商：阴山商路(10:00)\n阵营祭天：出征祭祀(19:00)\n",
//"二": "阵营攻防：逐鹿中原(20:00)\n",
//"三": "世界首领：少林·乱世，七秀·乱世(20:00)\n",
//"四": "阵营攻防：逐鹿中原(20:00)\n",
//"五": "世界首领：黑山林海，藏剑·乱世(20:00)\n",
//"六": "攻防前置：南屏山(12:00)\n阵营攻防：浩气盟；奇袭：恶人谷(13:00，19:00)\n",
//"日": "攻防前置：昆仑(12:00)\n阵营攻防：恶人谷；奇袭：浩气盟(13:00，19:00)\n"

func init() { // 插件主体
	engine := control.Register(ServiceName, &control.Options{
		DisableOnDefault: false,
		Help:             "每周日常定时推送\n",
	})
	cron.New().AddFunc()
}
