package jx3

var tuiKey = map[string]string{
	"大战":     "60f211c82d105c0014c5dd7d",
	"武林通鉴秘境": "60f211c82d105c0014c5de01",
	"武林通鉴公共": "60f211c82d105c0014c5dd97",
	"十人团队秘境": "60f211c82d105c0014c5ddcd",
	"阵营日常":   "60f211c82d105c0014c5dd9d",
}

var chatServer = map[string]string{
	"绝代天骄": "45",
	"唯我独尊": "19",
}

var allServer = map[string][2]string{
	"斗转星移": {"斗转星移", "电信五区"},
	"姨妈":   {"斗转星移", "电信五区"},
	"蝶恋花":  {"蝶恋花", "电信一区"},
	"龙争虎斗": {"龙争虎斗", "电信一区"},
	"长安城":  {"长安城", "电信一区"},
	"幽月轮":  {"幽月轮", "电信五区"},
	"剑胆琴心": {"剑胆琴心", "电信五区"},
	"煎蛋":   {"剑胆琴心", "电信五区"},
	"乾坤一掷": {"乾坤一掷", "电信五区"},
	"华乾":   {"乾坤一掷", "电信五区"},
	"唯我独尊": {"唯我独尊", "电信五区"},
	"唯满侠":  {"唯我独尊", "电信五区"},
	"梦江南":  {"梦江南", "电信五区"},
	"双梦":   {"梦江南", "电信五区"},
	"绝代天骄": {"绝代天骄", "电信八区"},
	"绝代":   {"绝代天骄", "电信八区"},
	"破阵子":  {"破阵子", "双线一区"},
	"念破":   {"破阵子", "双线一区"},
	"天鹅坪":  {"天鹅坪", "双线一区"},
	"纵月":   {"天鹅坪", "双线一区"},
	"飞龙在天": {"飞龙在天", "双线二区"},
	"大唐万象": {"大唐万象", "电信五区"},
	"青梅煮酒": {"青梅煮酒", "双线四区"},
	"共結來緣": {"共結來緣"},
	"傲血戰意": {"傲血戰意"},
	"巔峰再起": {"巔峰再起"},
	"江海雲夢": {"江海雲夢"},
}

var serverIP = map[string]string{
	"斗转星移": "125.88.195.133:3724",
	"蝶恋花":  "125.88.195.112:3724",
	"龙争虎斗": "125.88.195.69:3724",
	"长安城":  "125.88.195.52:3724",
	"幽月轮":  "125.88.195.117:3724",
	"剑胆琴心": "125.88.195.42:3724",
	"乾坤一掷": "125.88.195.154:3724",
	"唯我独尊": "125.88.195.89:3724",
	"梦江南":  "125.88.195.59:3724",
	"绝代天骄": "125.88.195.178:3724",
	"破阵子":  "103.228.229.128:3724",
	"天鹅坪":  "103.228.229.129:3724",
	"飞龙在天": "103.228.229.130:3724",
	"青梅煮酒": "103.228.229.127:3724",
}

// 第一位必须为官方名称
var mentalAlias = []metalData{
	{[]string{"冰心诀", "冰心", "雷电法王"}, 10081},
	{[]string{"云裳心经", "奶秀", "秀奶", "云裳"}, 10080},
	{[]string{"毒经", "dj"}, 10175},
	{[]string{"补天诀", "奶毒", "毒奶", "补天"}, 10176},
	{[]string{"花间游", "花间"}, 10021},
	{[]string{"离经易道", "奶花", "花奶"}, 10028},
	{[]string{"莫问", "咕咕"}, 10447},
	{[]string{"相知", "奶歌", "歌奶", "奶咕咕"}, 10448},
	{[]string{"藏剑", "问水诀", "山居剑意", "问水", "山居", "黄叽", "黄鸡", "叽"}, 10144},
	{[]string{"傲血战意", "傲血", "红色力道小人", "六边形战士", "嗷嗷战意"}, 10026},
	{[]string{"铁牢律", "策t", "策T", "铁牢"}, 10062},
	{[]string{"易筋经", "和尚", "光头", "易筋"}, 10003},
	{[]string{"洗髓经", "大师t", "和尚t", "洗髓"}, 10002},
	{[]string{"焚影圣诀", "喵喵", "焚影"}, 10242},
	{[]string{"明尊琉璃体", "喵t", "明尊玻璃体"}, 10243},
	{[]string{"分山劲", "苍爹", "分山", "岔劲", "铁王八"}, 10390},
	{[]string{"铁骨衣", "铁骨", "铁骨1", "纸糊衣", "纸骨衣"}, 10389},
	{[]string{"紫霞功", "气纯", "气咩"}, 10014},
	{[]string{"太虚剑意", "剑纯", "备胎", "渣男"}, 10015},
	{[]string{"天罗诡道", "田螺", "天罗"}, 10225},
	{[]string{"惊羽诀", "鲸鱼", "惊羽"}, 10224},
	{[]string{"笑尘决", "丐帮", "笑尘"}, 10268},
	{[]string{"北傲诀", "霸刀", "貂貂"}, 10464},
	{[]string{"凌海诀", "蓬莱"}, 10533},
	{[]string{"隐龙诀", "凌雪", "凌雪阁", "0雪"}, 10585},
	{[]string{"太玄经", "衍天", "衍天宗", "灯灯", "演员"}, 10615},
	{[]string{"无方", "药爹", "药宗"}, 10627},
	{[]string{"灵素", "药奶"}, 10626},
	{[]string{"孤锋诀", "刀宗"}, 10698},
}

var xiaoheiIndx = map[string]string{
	"电信点卡": "server1",
	"双线一区": "server2",
	"电信一区": "server3",
	"双线二区": "server4",
}
